# Reading the CSV File

In [17]:
import pandas as pd 
df = pd.read_csv("wicket.csv")
df

,Player,Span,Mat,Inns,Balls,Runs,Wkts,BBI,BBM,Ave,Econ,SR,5,10
0,M Muralitharan (ICC/SL),1992-2010,133,230,44039,18180,800,9/51,16/220,22.72,2.47,55.0,67,22
1,SK Warne (AUS),1992-2007,145,273,40705,17995,708,8/71,12/128,25.41,2.65,57.4,37,10
2,JM Anderson (ENG),2003-2021,164*,304,35079,16575,623,7/42,11/71,26.60,2.83,56.3,30,3
3,A Kumble (INDIA),1990-2008,132,236,40850,18355,619,10/74,14/149,29.65,2.69,65.9,35,8
4,GD McGrath (AUS),1993-2007,124,243,29248,12186,563,8/24,10/27,21.64,2.49,51.9,29,3
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
74,SCG MacGill (AUS),1998-2008,44,85,11237,6038,208,8/108,12/107,29.02,3.22,54.0,12,2
75,Saqlain Mushtaq (PAK),1995-2004,49,86,14070,6206,208,8/164,10/155,29.83,2.64,67.6,13,3
76,AME Roberts (WI),1974-1983,47,90,11135,5174,202,7/54,12/121,25.61,2.78,55.1,11,2
77,JA Snow (ENG),1965-1976,49,93,12021,5387,202,7/40,10/142,26.66,2.68,59.5,8,1
78,JR Thomson (AUS),1972-1985,51,90,10535,5601,200,6/46,9/105,28.00,3.18,52.6,8,0

#  the shape of the DataSet

In [5]:
df.shape

(79, 14)

# Spliting Country Name

In [25]:
file = df.copy()

file['Player'] = file['Player'].str.replace("(", "")
file['Player'] = file['Player'].str.replace(")", "")
file['Player'] = file['Player'].str.replace("\xa0", " ")

display(file.head())

,Player,Span,Mat,Inns,Balls,Runs,Wkts,Ave,Econ,SR,5,10
0,M Muralitharan ICC/SL,1992-2010,133,230,44039,18180,800,22.72,2.47,55.0,67,22
1,SK Warne AUS,1992-2007,145,273,40705,17995,708,25.41,2.65,57.4,37,10
2,JM Anderson ENG,2003-2021,164*,304,35079,16575,623,26.60,2.83,56.3,30,3
3,A Kumble INDIA,1990-2008,132,236,40850,18355,619,29.65,2.69,65.9,35,8
4,GD McGrath AUS,1993-2007,124,243,29248,12186,563,21.64,2.49,51.9,29,3

In [61]:

file_player = pd.DataFrame(file_player)

file_player['Country'] = file_player['Player'].str[-1]

print(type(file_player))

display(file_player.head())

<class 'pandas.core.frame.DataFrame'>

                      Player Country
0  [M, Muralitharan, ICC/SL]  ICC/SL
1           [SK, Warne, AUS]     AUS
2        [JM, Anderson, ENG]     ENG
3         [A, Kumble, INDIA]   INDIA
4         [GD, McGrath, AUS]     AUS

# Played for ICC

In [31]:

def icc_check(x):
    if "ICC" in x:
        return "Yes"
    else:
        return "No"

In [34]:
df['played_for_ICC'] = file_player['Country'].apply(icc_check)
df['played_for_ICC']

0     Yes
1      No
2      No
3      No
4      No
     ...
74     No
75     No
76     No
77     No
78     No
Name: played_for_ICC, Length: 79, dtype: object

In [38]:
df['played_for_ICC'].value_counts()

No     74
Yes     5
Name: played_for_ICC, dtype: int64

Number oF Players played for icc is : 5

# Played For Australia

In [42]:
file_player

                       Player Country
0   [M, Muralitharan, ICC/SL]  ICC/SL
1            [SK, Warne, AUS]     AUS
2         [JM, Anderson, ENG]     ENG
3          [A, Kumble, INDIA]   INDIA
4          [GD, McGrath, AUS]     AUS
..                        ...     ...
74        [SCG, MacGill, AUS]     AUS
75    [Saqlain, Mushtaq, PAK]     PAK
76         [AME, Roberts, WI]      WI
77            [JA, Snow, ENG]     ENG
78         [JR, Thomson, AUS]     AUS

[79 rows x 2 columns]

In [43]:
def AUS_check(x):
    if "AUS" in x:
        return "Yes"
    else:
        return "No"




df['played_for_Australia'] = file_player['Country'].apply(AUS_check)
df['played_for_Australia']

0      No
1     Yes
2      No
3      No
4     Yes
     ...
74    Yes
75     No
76     No
77     No
78    Yes
Name: played_for_Australia, Length: 79, dtype: object

In [45]:
df['played_for_Australia'].value_counts()

No     61
Yes    18
Name: played_for_Australia, dtype: int64

played_for_Australia = 18 PLAYERS

# Played For Bangladesh

In [47]:
display(file_player)
def BD_check(x):
    if "BD" in x:
        return "Yes"
    else:
        return "No"




df['played_for_Bangladesh'] = file_player['Country'].apply(BD_check)
df['played_for_Bangladesh']

                       Player Country
0   [M, Muralitharan, ICC/SL]  ICC/SL
1            [SK, Warne, AUS]     AUS
2         [JM, Anderson, ENG]     ENG
3          [A, Kumble, INDIA]   INDIA
4          [GD, McGrath, AUS]     AUS
..                        ...     ...
74        [SCG, MacGill, AUS]     AUS
75    [Saqlain, Mushtaq, PAK]     PAK
76         [AME, Roberts, WI]      WI
77            [JA, Snow, ENG]     ENG
78         [JR, Thomson, AUS]     AUS

[79 rows x 2 columns]

0     No
1     No
2     No
3     No
4     No
      ..
74    No
75    No
76    No
77    No
78    No
Name: played_for_Bangladesh, Length: 79, dtype: object

In [48]:
df['played_for_Bangladesh'].value_counts()

No     78
Yes     1
Name: played_for_Bangladesh, dtype: int64

Number of players played for Bangladesh = 1

In [56]:
df

,Span,Mat,Inns,Balls,Runs,Wkts,Ave,Econ,SR,5,10,0,1,played_for_ICC,played_for_Australia,played_for_Bangladesh,Economy_Rate
0,1992-2010,133,230,44039,18180,800,22.72,2.47,55.0,67,22,M Muralitharan,ICC/SL),Yes,No,No,2.47
1,1992-2007,145,273,40705,17995,708,25.41,2.65,57.4,37,10,SK Warne,AUS),No,Yes,No,2.65
2,2003-2021,164*,304,35079,16575,623,26.60,2.83,56.3,30,3,JM Anderson,ENG),No,No,No,2.83
3,1990-2008,132,236,40850,18355,619,29.65,2.69,65.9,35,8,A Kumble,INDIA),No,No,No,2.69
4,1993-2007,124,243,29248,12186,563,21.64,2.49,51.9,29,3,GD McGrath,AUS),No,Yes,No,2.49
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
74,1998-2008,44,85,11237,6038,208,29.02,3.22,54.0,12,2,SCG MacGill,AUS),No,Yes,No,3.22
75,1995-2004,49,86,14070,6206,208,29.83,2.64,67.6,13,3,Saqlain Mushtaq,PAK),No,No,No,2.64
76,1974-1983,47,90,11135,5174,202,25.61,2.78,55.1,11,2,AME Roberts,WI),No,No,No,2.78
77,1965-1976,49,93,12021,5387,202,26.66,2.68,59.5,8,1,JA Snow,ENG),No,No,No,2.68
78,1972-1985,51,90,10535,5601,200,28.00,3.18,52.6,8,0,JR Thomson,AUS),No,Yes,No,3.18

# Calculating Economy Rate

In [52]:
df['Economy_Rate'] = df['Econ']
df['Economy_Rate']

0     2.47
1     2.65
2     2.83
3     2.69
4     2.49
      ...
74    3.22
75    2.64
76    2.78
77    2.68
78    3.18
Name: Economy_Rate, Length: 79, dtype: float64

In [53]:
df['Economy_Rate'].value_counts()

2.97    3
2.68    3
2.83    3
2.10    2
3.30    2
3.09    2
2.78    2
2.93    2
3.22    2
2.99    2
2.63    2
2.30    2
2.80    2
2.85    2
2.98    2
2.59    2
2.47    2
2.69    2
2.54    1
3.46    1
2.75    1
3.24    1
2.53    1
2.82    1
2.64    1
2.48    1
2.21    1
3.16    1
2.45    1
3.37    1
2.74    1
2.33    1
2.65    1
2.84    1
3.01    1
3.19    1
3.10    1
2.49    1
2.71    1
3.28    1
3.26    1
3.33    1
3.35    1
3.18    1
2.22    1
2.14    1
1.98    1
2.70    1
2.79    1
3.27    1
3.23    1
3.07    1
2.16    1
2.39    1
2.61    1
3.02    1
2.92    1
3.25    1
Name: Economy_Rate, dtype: int64

In [54]:
df['Economy_Rate'].min()

1.98

minimum economy Rate = 1.98

In [55]:
df['Economy_Rate'].max()

3.46

Max Economy Rate = 3.46

# Calculating Strike Rate

In [58]:

df['Strike_Rate'] = df['SR']
df['Strike_Rate']

0     55.0
1     57.4
2     56.3
3     65.9
4     51.9
      ...
74    54.0
75    67.6
76    55.1
77    59.5
78    52.6
Name: Strike_Rate, Length: 79, dtype: float64

In [59]:
df['Strike_Rate'].min()

41.2

Lowest Strike rate = 41.2

# Calculating Average

In [60]:
df['Average'] = df['Ave']
df['Average'].min()

20.94

Lowest Average = 20.94